plcexpert/plc-x-arduino-hardware/avr/boards.txt
## MicroPLC 1.3
## -------------------------------------------------
PLCAVR.menu.module.MICROPLC=PLC-Micro 1.3

PLCAVR.menu.module.MICROPLC.bootloader.high_fuses=0xD6
PLCAVR.menu.module.MICROPLC.bootloader.low_fuses=0xFF
PLCAVR.menu.module.MICROPLC.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.MICROPLC.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.MICROPLC.bootloader.lock_bits=0xCF
PLCAVR.menu.module.MICROPLC.bootloader.file=optiboot_m328pb.hex

PLCAVR.menu.module.MICROPLC.build.mcu=atmega328pb
PLCAVR.menu.module.MICROPLC.build.f_cpu=16000000L
PLCAVR.menu.module.MICROPLC.build.variant=microplc
PLCAVR.menu.module.MICROPLC.build.board=AVR_UNO

PLCAVR.menu.module.MICROPLC.upload.maximum_size=32256
PLCAVR.menu.module.MICROPLC.upload.maximum_data_size=2048
PLCAVR.menu.module.MICROPLC.upload.speed=57600

## RFID Reader
## -------------------------------------------------
PLCAVR.menu.module.RFID=PLC-RFID Reader

PLCAVR.menu.module.RFID.bootloader.high_fuses=0xdf
PLCAVR.menu.module.RFID.bootloader.low_fuses=0xf1
PLCAVR.menu.module.RFID.bootloader.extended_fuses=0xFF
PLCAVR.menu.module.RFID.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.RFID.bootloader.lock_bits=0xFF
PLCAVR.menu.module.RFID.bootloader.file=attiny85.hex
PLCAVR.menu.module.RFID.bootloader.tool=arduino:avrdude

PLCAVR.menu.module.RFID.build.core=digistump:tiny
PLCAVR.menu.module.RFID.build.mcu=attiny85
PLCAVR.menu.module.RFID.build.f_cpu=16000000L
PLCAVR.menu.module.RFID.build.variant=tiny85
PLCAVR.menu.module.RFID.build.board=attiny

PLCAVR.menu.module.RFID.upload.maximum_size=8192
PLCAVR.menu.module.RFID.upload.maximum_data_size=512
PLCAVR.menu.module.RFID.upload.tool=micronucleus
PLCAVR.menu.module.RFID.upload.protocol=usb
PLCAVR.menu.module.RFID.upload.wait_for_upload_port=false
PLCAVR.menu.module.RFID.upload.use_1200bps_touch=false
PLCAVR.menu.module.RFID.upload.disable_flushing=false

PLCAVR.menu.module.RFID.msg.info=Press Reset when Uploading is shown.
PLCAVR.menu.module.RFID.vid.0=0x16D0
PLCAVR.menu.module.RFID.pid.0=0x0753

## TM - Temperature module
## -------------------------------------------------
PLCAVR.menu.module.TM=PLC-TM

PLCAVR.menu.module.TM.bootloader.high_fuses=0xD6
PLCAVR.menu.module.TM.bootloader.low_fuses=0xFF
PLCAVR.menu.module.TM.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.TM.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.TM.bootloader.lock_bits=0xCF
PLCAVR.menu.module.TM.bootloader.file=optiboot_m328pb.hex

PLCAVR.menu.module.TM.build.mcu=atmega328pb
PLCAVR.menu.module.TM.build.f_cpu=16000000L
PLCAVR.menu.module.TM.build.variant=tm
PLCAVR.menu.module.TM.build.board=AVR_UNO

PLCAVR.menu.module.TM.upload.maximum_size=32256
PLCAVR.menu.module.TM.upload.maximum_data_size=2048
PLCAVR.menu.module.TM.upload.speed=57600

## UK - universal kit
## -------------------------------------------------
PLCAVR.menu.module.UK=PLC-UK

PLCAVR.menu.module.UK.bootloader.high_fuses=0xDA
PLCAVR.menu.module.UK.bootloader.low_fuses=0xFF
PLCAVR.menu.module.UK.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.UK.bootloader.unlock_bits=0x3F
PLCAVR.menu.module.UK.bootloader.lock_bits=0x0F
PLCAVR.menu.module.UK.bootloader.file=ATmegaBOOT_168_atmega328.hex

PLCAVR.menu.module.UK.build.mcu=atmega328p
PLCAVR.menu.module.UK.build.f_cpu=16000000L
PLCAVR.menu.module.UK.build.variant=atmega328p
PLCAVR.menu.module.UK.build.board=AVR_UNO

PLCAVR.menu.module.UK.upload.maximum_size=32256
PLCAVR.menu.module.UK.upload.maximum_data_size=2048
PLCAVR.menu.module.UK.upload.speed=57600

## WISP - Wirelles IPS programmer
## -------------------------------------------------
PLCAVR.menu.module.WISP=PLC-WISP

PLCAVR.menu.module.WISP.bootloader.high_fuses=0xD6
PLCAVR.menu.module.WISP.bootloader.low_fuses=0xE2
PLCAVR.menu.module.WISP.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.WISP.bootloader.unlock_bits=0x3F
PLCAVR.menu.module.WISP.bootloader.lock_bits=0x0F
PLCAVR.menu.module.WISP.bootloader.file=optiboot_m328pb.hex

PLCAVR.menu.module.WISP.build.mcu=ATmega328PB
PLCAVR.menu.module.WISP.build.f_cpu=8000000L
PLCAVR.menu.module.WISP.build.variant=atmega328pb
PLCAVR.menu.module.WISP.build.board=AVR_UNO

PLCAVR.menu.module.WISP.upload.maximum_size=32256
PLCAVR.menu.module.WISP.upload.maximum_data_size=2048
PLCAVR.menu.module.WISP.upload.speed=57600


## --------------------------- CUSTOMER PRODUCTS ---------------------

## AccSens
## -------------------------------------------------
PLCAVR.menu.module.X_ACCSENS=X-AccSens 1.0

PLCAVR.menu.module.X_ACCSENS.bootloader.high_fuses=0xDA
PLCAVR.menu.module.X_ACCSENS.bootloader.low_fuses=0xFF
PLCAVR.menu.module.X_ACCSENS.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.X_ACCSENS.bootloader.unlock_bits=0x3F
PLCAVR.menu.module.X_ACCSENS.bootloader.lock_bits=0x0F
PLCAVR.menu.module.X_ACCSENS.bootloader.file=ATmegaBOOT_168_atmega328.hex

PLCAVR.menu.module.X_ACCSENS.build.mcu=atmega328p
PLCAVR.menu.module.X_ACCSENS.build.f_cpu=16000000L
PLCAVR.menu.module.X_ACCSENS.build.variant=atmega328p
PLCAVR.menu.module.X_ACCSENS.build.board=AVR_UNO

PLCAVR.menu.module.X_ACCSENS.upload.maximum_size=30000
PLCAVR.menu.module.X_ACCSENS.upload.maximum_data_size=2048
PLCAVR.menu.module.X_ACCSENS.upload.speed=57600

###################   ATMEL AVR (END)  ##############################